In [3]:
# 移除 某一列 或 某一行

import numpy as np
import pandas as pd

s1 = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
display(s1)

display(s1.drop('c'))

display(s1.drop(['c','d']))

# s1 不會被更改
display(s1)

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

a    0.0
b    1.0
e    4.0
dtype: float64

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [16]:
frame1 = pd.DataFrame( np.arange(9).reshape(3, 3),
             index=['a', 'b', 'c'],
             columns=['台北', '台中', '高雄'])

display(frame1)

display(frame1.drop('c', axis=0))

display(frame1.drop(index='c'))

display(frame1.drop(index=['a', 'c']))

display(frame1.drop('台中', axis=1))

display(frame1.drop(columns='台中'))

display(frame1.drop(columns=['台北', '高雄']))

   台北  台中  高雄
a   0   1   2
b   3   4   5
c   6   7   8

   台北  台中  高雄
a   0   1   2
b   3   4   5

   台北  台中  高雄
a   0   1   2
b   3   4   5

   台北  台中  高雄
b   3   4   5

   台北  高雄
a   0   2
b   3   5
c   6   8

   台北  高雄
a   0   2
b   3   5
c   6   8

   台中
a   1
b   4
c   7